// 1、数组sort(),大于0交换位置
let arr = [
  1, 2, 3, 4, 5, 6, 7, 7, 8, 9, 10, 0, 1, 23, 23, 45, 65, 6, 76, 34, 33, 4, 34,
  3, 432, 4, 2, 2, 15, 67, 89, 09, 87, 65, 67, 89, 091, 87, 26, 356, 17, 890,
  98, 73, 65, 32, 71, 89, 02, 38, 4, 76, 2, 78, 19, 38, 4, 7, 6, 3, 2, 7, 8, 9,
  1, 28, 74, 6, 7, 3, 289,
];
console.info(
  arr.sort((a, b) => {
    console.log(a, b, ">>");
    return a - b;
  }),
  "Array.sort>>>"
);
//  初始a:arr[1],b:arr[0]
//  比较，如果不交换位置，a和b都往后推移一个元素，a:arr[2],b:arr[1]
//  比较，如果需要交换位置，a保持位置不变，使用二分法方法，b=arr[aIndex/2],a:arr[aIndex],
